{
  "name"      : "Josh Vickerson",
  "email"     : "josh@joshvickerson.com",
  "website"   : "joshvickerson.com",
  "profile"   : "Student, web developer, aspiring minimalist, and programmer with a keen interest in design looking for opportunities to impact the lives of others.",
  "skills"    : "HTML, CSS, JavaScript, AngularJS, PHP, Wordpress, Node.js, Java, and Python",
  "education" : {
                  "school"   : "Rochester Institute of Technology",
                  "location" : "Rochester, NY 14623",
                  "major"    : "Information Technology",
                  "minor"    : "Communications",
                  "years"    : "2011 - 2016"
                },
  "jobs"      : {
                  "0" : {
                    "company"    : "Brand Networks",
                    "title"      : "Student Software Engineer (Co-Op)",
                    "location"   : "Rochester, NY",
                    "date"       : "Jan, 2014 - July, 2015",
                    "description": "Completed web development projects for Brand Networks' clients using various technologies, including Wordpress, Node.js, and AngularJS. Internal projects included an embeddable widget framework, project generator, i18n framework and a livestream Q&A widget."
                  },
                  "1" : {
                    "company"    : "RIT New Student Orientation",
                    "title"      : "Student Orientation Coordinator",
                    "location"   : "Rochester, NY",
                    "date"       : "August, 2012 - August, 2015",
                    "description": "Worked with professional staff to develop and deliver the Orientation experience for new students at RIT. Recruited and hired staff, managed operations, developed and facilitated a training program for more than 150 staff."
                  },
                  "2" : {
                    "company"    : "RIT Information Technology Services",
                    "title"      : "Senior Residential Computing Consultant, Lead TCenter Developer",
                    "location"   : "Rochester, NY",
                    "date"       : "Oct, 2011 - Oct, 2014",
                    "description": "Provided technical support and services for computers personally owned by RIT students, faculty and staff. Also responsible for quality assurance checks in both technical- and customer service-oriented tasks. Also the lead web developer for an internal PHP / MySQL application used as a ticketing system."
                  },
                  "3" : {
                    "company"    : "iD Tech Camps",
                    "title"      : "Lead Instructor",
                    "location"   : "Princeton, NJ",
                    "date"       : "2012 - 2014",
                    "description": "Instructed a class of 8 school-aged children in various topics including programming in Java, and web design and development. Additional responsibilities included leading group activities, interacting with parents for camp operations, and serving as a mentor / resource for other instructors."
                  },
                  "4" : {
                    "company"    : "RIT Academic Support Center",
                    "title"      : "Lead Peer Advisor",
                    "location"   : "Rochester, NY",
                    "date"       : "2013 - Current",
                    "description": "Worked in a classroom setting for a freshman enrichment course. Responsibilities included planning and facilitating lessons and activities, and acting as a mentor and point of contact for freshman students. Also responsible for planning and facilitating team meetings, and reporting to professional staff."
                  }
                }
}
